; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	image0 - mode
	thermograph2 - mode
	spectrograph3 - mode
	spectrograph1 - mode
	Star3 - direction
	Star0 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star0)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 GroundStation6)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star12)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(pointing satellite2 Star2)
	(pointing satellite3 GroundStation1)
	(have_image Phenomenon7 image0)
	(have_image Phenomenon8 spectrograph1)
	(have_image Planet9 spectrograph3)
	(have_image Planet10 spectrograph3)
	(have_image Star11 spectrograph1)
	(have_image Star12 spectrograph3)
))

)

; plan
1. (turn_to satellite3 groundstation1 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 groundstation1)
   goals met: 1 of 9
2. (turn_to satellite2 star2 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star2)
   goals met: 2 of 9
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 9
4. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 2 of 9
5. (turn_to satellite1 star11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star11)
   goals met: 2 of 9
6. (take_image satellite1 star11 instrument3 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 3 of 9
7. (turn_to satellite1 phenomenon8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 9
8. (turn_to satellite0 groundstation1 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 9
9. (take_image satellite1 phenomenon8 instrument3 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 4 of 9
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 9
11. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 4 of 9
12. (turn_to satellite0 phenomenon7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 9
13. (take_image satellite0 phenomenon7 instrument0 image0)
   added: (have_image phenomenon7 image0)
   goals met: 5 of 9
14. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   goals met: 5 of 9
15. (take_image satellite0 planet10 instrument0 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 6 of 9
16. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   goals met: 6 of 9
17. (take_image satellite0 planet9 instrument0 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 7 of 9
18. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 7 of 9
19. (take_image satellite0 star12 instrument0 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 8 of 9
20. (turn_to satellite0 groundstation6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation6)
   goals met: 9 of 9
